[
    {
        "id": 1,
        "destination": "Los Angeles",
        "slug": "los-angeles",
        "dates_visited" : {
            "start_date": "01-31-2024",
            "end_date": "02-07-2024"
        },
        "summary": "Experience the trendiest neighborhoods and cultural hotspots of Los Angeles...except, we got tarnatial downpour - the most ever in 2 days in over 2 decades!",
        "itinerary": [
            {
                "day": "Day 1",
                "activities": [
                    "Explore Venice Beach and Boardwalk",
                    "Visit the Venice Canals",
                    "Dine at Gjelina"
                ]
            },
            {
                "day": "Day 2",
                "activities": [
                    "Hike to the Hollywood Sign",
                    "Hike to the Griffith Observatory"
                ]
            },
            {
                "day": "Day 3",
                "activities": [
                    "Stroll along Melrose Avenue for shopping and street art",
                    "Visit LACMA (Los Angeles County Museum of Art)",
                    "Visit Peterson Automobile Museum"
                ]
            },
            {
                "day": "Day 4",
                "activities": [
                    "Explore the Arts District",
                    "Visit The Broad Museum",
                    "Lunch at Grand Central Market"
                ]
            },
            {
                "day": "Day 5",
                "activities": [
                    "Tour the Getty Center",
                    "Relax at Santa Monica Pier",
                    "Dinner at Nobu Malibu"
                ]
            },
            {
                "day": "Day 6",
                "activities": [
                    "Shop and dine on Abbot Kinney Boulevard",
                    "Visit the Hammer Museum",
                    "Enjoy sunset at Manhattan Beach"
                ]
            },
            {
                "day": "Day 7",
                "activities": [
                    "Hike in Runyon Canyon Park",
                    "Explore the Sunset Strip",
                    "Farewell dinner at Perch"
                ]
            }
        ],
        "recommendations": {
            "places": [
                {
                  "name": "The Last Bookstore",
                  "description": "A must-visit indie bookstore with a unique atmosphere.",
                  "category": "Bookstore",
                  "location": "453 S Spring St, Los Angeles, CA 90013"
                },
                {
                  "name": "Griffith Park",
                  "description": "One of the largest urban parks in North America, offering hiking trails and scenic views of LA.",
                  "category": "Park",
                  "location": "Griffith Park, Los Angeles, CA 90027"
                }
            ],
            "activities": [
                {
                    "name": "Street Art Tour in the Arts District",
                    "description": "Explore the vibrant street art scene in the hip Arts District with a guided tour."
                },
                {
                    "name": "Venice Beach Bike Rental",
                    "description": "Rent a bike and cruise along the iconic Venice Beach Boardwalk, soaking in the sights and sounds."
                }
            ],
            "restaurants": [
                {
                    "name": "Sqirl",
                    "description": "Famous for their inventive breakfast and brunch dishes featuring local ingredients.",
                    "cuisine": "American, Californian",
                    "location": "720 N Virgil Ave #4, Los Angeles, CA 90029"
                },
                {
                    "name": "Bestia",
                    "description": "A trendy Italian restaurant known for its house-made charcuterie and pasta dishes.",
                    "cuisine": "Italian",
                    "location": "2121 E 7th Pl, Los Angeles, CA 90021"
                }
            ]
        },
        "transportation": "Uber/Lyft or rental car are convenient options for getting around LA. Public transportation is also available via Metro buses and trains.",
        "accommodation": "Stay in a trendy boutique hotel or Airbnb rental in neighborhoods like Venice Beach, Silver Lake, or Downtown LA.",
        "tips": "Pack comfortable walking shoes and layers, as LA weather can vary throughout the day. Make restaurant reservations in advance, especially for popular spots.",
        "cost_estimate": "Estimated cost for a week in LA can range from $1500 to $3000, depending on accommodation, dining choices, and activities.",
        "language_spoken": "English is the primary language spoken in Los Angeles.",
        "currency_used": "United States Dollar (USD)",
        "emergency_contact": "Emergency contact information, including local emergency services, embassy or consulate contact details",
        "weather_information": "February in Los Angeles typically has mild and pleasant weather, with average temperatures ranging from 50°F (10°C) to 70°F (21°C).",
        "best_time_to_visit": "Spring (March to May) and Fall (September to November) are ideal times to visit Los Angeles, with mild temperatures and fewer crowds.",
        "recommended_duration": "A week is a good amount of time to explore Los Angeles and its diverse neighborhoods and attractions.",
        "local_customs": "Tipping is customary in Los Angeles, typically 15-20% in restaurants and for services like taxis and hairdressers."
    },
    {
        "id": 2,
        "destination": "New York City",
        "slug": "new-york-city",
        "dates_visited": {
            "start_date": "01-01-2024",
            "end_date": "01-07-2024"
        },
        "summary": "Experience the hustle and bustle of the Big Apple, from iconic landmarks like Times Square and the Statue of Liberty to trendy neighborhoods like Brooklyn and Greenwich Village.",
        "itinerary": [
            {
                "day": "Day 1",
                "activities": [
                    "Explore Times Square and visit the TKTS booth for discounted Broadway tickets",
                    "Take a stroll through Central Park and visit the Central Park Zoo",
                    "Dine at a classic New York deli for lunch"
                ]
            },
            {
                "day": "Day 2",
                "activities": [
                    "Visit the Statue of Liberty and Ellis Island",
                    "Take a ferry ride to Staten Island for panoramic views of the city skyline",
                    "Explore the High Line park"
                ]
            },
            {
                "day": "Day 3",
                "activities": [
                    "Discover the museums of Museum Mile, including the Metropolitan Museum of Art and the Guggenheim Museum",
                    "Take a walking tour of historic neighborhoods like the Upper East Side and Harlem",
                    "Catch a Broadway show in the evening"
                ]
            },
            {
                "day": "Day 4",
                "activities": [
                    "Shop along Fifth Avenue, including iconic stores like Tiffany & Co. and Saks Fifth Avenue",
                    "Visit the Empire State Building for panoramic views of the city",
                    "Enjoy dinner in Little Italy"
                ]
            },
            {
                "day": "Day 5",
                "activities": [
                    "Explore the trendy neighborhoods of Brooklyn, including Williamsburg and DUMBO",
                    "Walk across the Brooklyn Bridge for stunning views of the Manhattan skyline",
                    "Sample artisanal food at Smorgasburg food market"
                ]
            },
            {
                "day": "Day 6",
                "activities": [
                    "Take a ferry to Governors Island for outdoor activities and historic sites",
                    "Visit the 9/11 Memorial & Museum",
                    "Explore the vibrant nightlife of Greenwich Village"
                ]
            },
            {
                "day": "Day 7",
                "activities": [
                    "Visit the Museum of Modern Art (MoMA)",
                    "Explore the diverse neighborhoods of Queens, including Astoria and Long Island City",
                    "Farewell dinner in a trendy restaurant in the Meatpacking District"
                ]
            }
        ],
        "recommendations": {
            "places": [
                {
                    "name": "Top of the Rock Observation Deck",
                    "description": "Enjoy stunning views of Manhattan from the top of the Rockefeller Center.",
                    "category": "Landmark",
                    "location": "30 Rockefeller Plaza, New York, NY 10112"
                },
                {
                    "name": "Brooklyn Botanic Garden",
                    "description": "Escape the city hustle and explore beautiful gardens and greenhouses in Brooklyn.",
                    "category": "Garden",
                    "location": "990 Washington Ave, Brooklyn, NY 11225"
                }
            ],
            "activities": [
                {
                    "name": "Broadway Walking Tour",
                    "description": "Learn about the history of Broadway and its iconic theaters on a guided walking tour.",
                    "category": "Tour"
                },
                {
                    "name": "Central Park Bike Rental",
                    "description": "Rent a bike and explore Central Park at your own pace, visiting landmarks like Bethesda Terrace and Bow Bridge.",
                    "category": "Recreation"
                }
            ],
            "restaurants": [
                {
                    "name": "Katz's Delicatessen",
                    "description": "Experience the classic New York deli atmosphere and enjoy pastrami sandwiches and matzo ball soup.",
                    "cuisine": "Jewish, Deli",
                    "location": "205 E Houston St, New York, NY 10002"
                },
                {
                    "name": "Le Bernardin",
                    "description": "Indulge in exquisite seafood dishes prepared by renowned chef Eric Ripert.",
                    "cuisine": "French, Seafood",
                    "location": "155 W 51st St, New York, NY 10019"
                }
            ]
        },
        "transportation": "Subway and bus are convenient options for getting around New York City. Taxis and rideshare services like Uber and Lyft are also widely available.",
        "accommodation": "Stay in a hotel in Manhattan for easy access to major attractions. Alternatively, explore trendy neighborhoods like Brooklyn and Queens for unique accommodation options.",
        "tips": "Plan your itinerary in advance and book tickets for popular attractions to avoid long lines. Be prepared for walking and wear comfortable shoes. Explore the city's diverse neighborhoods to experience its cultural richness.",
        "cost_estimate": "Estimated cost for a week in New York City can range from $2000 to $4000, depending on accommodation, dining choices, and activities.",
        "language_spoken": "English is the primary language spoken in New York City, but you'll also hear a variety of languages due to its diverse population.",
        "currency_used": "United States Dollar (USD)",
        "emergency_contact": "Emergency contact information, including local emergency services, embassy or consulate contact details",
        "weather_information": "January in New York City is typically cold, with average temperatures ranging from 25°F (-4°C) to 40°F (4°C). Be prepared for winter weather, including snow and freezing temperatures.",
        "best_time_to_visit": "Spring (April to June) and Fall (September to November) are ideal times to visit New York City, with mild weather and fewer tourists.",
        "recommended_duration": "A week is a good amount of time to explore New York City and its iconic attractions, but you could easily spend more time to delve deeper into its neighborhoods and cultural offerings.",
        "local_customs": "Tipping is customary in New York City, typically 15-20% in restaurants and for services like taxis and hairdressers. Respect personal space and be aware of your surroundings in crowded areas."
    }
]